LearningToLearn.org
#+TITLE Learning how to Learn
#+DESCRIPTION A guide on how to approach learning

* Effective Learning

** Learning is Social

*** As social creatures, we need to externalize goals to make them 'real'

*** Knowledge without community is meaningless

*** Peer-interaction makes learning more active

**** Learning is a struggle

**** People who have finished the journey can offer a lot of insight, advice and correction

**** Only people still currently in the struggle can engage with us in a unique way that teachers and other experts can never fully simulate

** Learning is Emotional

*** It is a *lot* harder to retain a new skill when you're stressed

*** As adults we are good at 'powering through' to get tasks done--but *finishing* labs isn't the real goal

** Learning is Exhausting

*** You will probably need more breaks than normal

*** Try to schedule lab time for moments in the day when you feel more refreshed

*** Small, frequent bursts of studying

*** Look out for burn out (marathon not a sprint)

** Learning is Failure

*** We learn the most from being corrected

*** As humans we *hate* being corrected, as adults we are *bad* ad being corrected, as learners we *need* to be corrected

*** The great thing about the labs is that the tests will give us *immediate* and *consequence-free* feedback. If a test fails, no one will see but you and nothing will go wrong. If you stuck, making a random guess at what to do, running the tests, and seeing the errors will help you learn *much more* than getting everything right the first time.
