LearningToLearn.md

# Table of Contents

1.  [Effective Learning](#orgc859aad)
    1.  [Learning is Social](#org2b8604c)
        1.  [As social creatures, we need to externalize goals to make them 'real'](#orgacb41a0)
        2.  [Knowledge without community is meaningless](#orge970322)
        3.  [Peer-interaction makes learning more active](#org95ca2a5)
    2.  [Learning is Emotional](#org32c38b4)
        1.  [It is a **lot** harder to retain a new skill when you're stressed](#org1e93b75)
        2.  [As adults we are good at 'powering through' to get tasks done&#x2013;but **finishing** labs isn't the real goal](#org406ad08)
    3.  [Learning is Exhausting](#orgd8ea837)
        1.  [You will probably need more breaks than normal](#org45826de)
        2.  [Try to schedule lab time for moments in the day when you feel more refreshed](#org2dc223b)
        3.  [Small, frequent bursts of studying](#org0d76355)
        4.  [Look out for burn out (marathon not a sprint)](#org64925aa)
    4.  [Learning is Failure](#org17e3379)
        1.  [We learn the most from being corrected](#org2ef7ad1)
        2.  [As humans we **hate** being corrected, as adults we are **bad** ad being corrected, as learners we **need** to be corrected](#orgc92fd4b)
        3.  [The great thing about the labs is that the tests will give us **immediate** and **consequence-free** feedback. If a test fails, no one will see but you and nothing will go wrong. If you stuck, making a random guess at what to do, running the tests, and seeing the errors will help you learn **much more** than getting everything right the first time.](#org11fa8aa)

\#+TITLE Learning how to Learn
\#+DESCRIPTION A guide on how to approach learning


<a id="orgc859aad"></a>

# Effective Learning


<a id="org2b8604c"></a>

## Learning is Social


<a id="orgacb41a0"></a>

### As social creatures, we need to externalize goals to make them 'real'


<a id="orge970322"></a>

### Knowledge without community is meaningless


<a id="org95ca2a5"></a>

### Peer-interaction makes learning more active

1.  Learning is a struggle

2.  People who have finished the journey can offer a lot of insight, advice and correction

3.  Only people still currently in the struggle can engage with us in a unique way that teachers and other experts can never fully simulate


<a id="org32c38b4"></a>

## Learning is Emotional


<a id="org1e93b75"></a>

### It is a **lot** harder to retain a new skill when you're stressed


<a id="org406ad08"></a>

### As adults we are good at 'powering through' to get tasks done&#x2013;but **finishing** labs isn't the real goal


<a id="orgd8ea837"></a>

## Learning is Exhausting


<a id="org45826de"></a>

### You will probably need more breaks than normal


<a id="org2dc223b"></a>

### Try to schedule lab time for moments in the day when you feel more refreshed


<a id="org0d76355"></a>

### Small, frequent bursts of studying


<a id="org64925aa"></a>

### Look out for burn out (marathon not a sprint)


<a id="org17e3379"></a>

## Learning is Failure


<a id="org2ef7ad1"></a>

### We learn the most from being corrected


<a id="orgc92fd4b"></a>

### As humans we **hate** being corrected, as adults we are **bad** ad being corrected, as learners we **need** to be corrected


<a id="org11fa8aa"></a>

### The great thing about the labs is that the tests will give us **immediate** and **consequence-free** feedback. If a test fails, no one will see but you and nothing will go wrong. If you stuck, making a random guess at what to do, running the tests, and seeing the errors will help you learn **much more** than getting everything right the first time.

